#+BEGIN_HTML
---
layout: page
title: Data visualisation
tagline: " A picture worths a hundred words"
categories: [emacs, literate programming]
tags: [org-mode, emacs, uml, plantuml, ditaa, schema, babel]
---
#+END_HTML
#+OPTIONS: tags:nil toc:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t



** JVM required
   #+BEGIN_SRC sh :exports both
   java -version 2>&1
   #+END_SRC

   #+RESULTS:
   | java    | version | 1.6.0_39    |           |            |                                 |       |
   | OpenJDK | Runtime | Environment | (IcedTea6 |   1.13.11) | (6b39-1.13.11-0ubuntu0.14.04.1) |       |
   | OpenJDK | Server  | VM          | (build    | 23.25-b01, | mixed                           | mode) |

   If it is not so, you'll need to install it.

** Define java plugins path for emacs usage
   
   Evaluate expression below in *scratch* buffer to determine
   where org expects to seeks its libraries by default config:

     #+BEGIN_SRC elisp :exports both
       (expand-file-name
       "ditaa.jar"
       (file-name-as-directory
       (expand-file-name
       "scripts"
       (file-name-as-directory
       (expand-file-name
       "../contrib"
       (file-name-directory (org-find-library-dir "org")))))))
     #+END_SRC

     #+RESULTS:
     : /home/antony/.emacs.d/elpa/contrib/scripts/ditaa.jar

      
